Repository: an90ass/IbanValut
Catalog: lib/l10n/intl_*.arb
Languages: tr

source: Hello!
tr: Merhaba!

# loginPage
source: Login Screen
tr: Giriş Sayfası

source: Settings Screen
tr: Ayarlar Sayfası

source: Change Language
tr: Dil değiştir

source: Home Page
tr: Ana Sayfa

# welcomeMessage
source: Welcome to IABN Vault, your secure and reliable solution for managing your IBANs.
tr: IBAN Vault'a hoş geldiniz. IBAN'larınızı güvenli ve güvenilir bir şekilde yönetmek için çözümünüz.

source: Search...
tr: Ara...

source: My IBANs
tr: IBAN'larım

source: Friends IBANs
tr: Arkadaş IBAN'ları

source: No IBANs found.
tr: Herhangi bir IBAN bulunamadı.

source: Edit IBAN
tr: IBAN Düzenle

# editFriendIban
source: Edit Friends IBAN
tr: Arkadaş IBAN'ını Düzenle

# friendNameLabel
source: Friend's Name
tr: Arkadaşın Adı

source: Bank Name
tr: Banka Adı

source: IBAN Number
tr: IBAN Numarası

source: Cancel
tr: İptal

source: Save
tr: Kaydet

# pleaseSelectBank
source: Please select a bank
tr: Lütfen bir banka seçin

source: Please enter IBAN
tr: Lütfen IBAN girin

source: Please enter bank name
tr: Lütfen banka adını girin

# ibanUpdated
source: IBAN updated successfully!
tr: IBAN başarıyla güncellendi!

# ibanDeleted
source: IBAN deleted successfully!
tr: IBAN başarıyla silindi!

# dateLabel
source: Date Added
tr: Eekleme Tarihi

# ibanQrTitle
source: IBAN QR Code
tr: IBAN QR Kodu

# ibanCopied
source: IBAN copied successfully!
tr: IBAN başarıyla kopyalandı!

source: Close
tr: Kapat

source: Add IBAN Page
tr: IBAN Ekleme Sayfası

# addIbanSubtitle
source: Add your IBAN details securely and easily.
tr: IBAN bilgilerinizi güvenli ve kolay bir şekilde ekleyin.

# myIbanTab
source: My IBAN
tr: IBAN'ım

# friendIbanTab
source: Friend's IBAN
tr: Arkadaş IBAN'ı

source: Add New IBAN
tr: Yeni IBAN Ekle

# ibanHint
source: e.g. TR0380000000608010167519
tr: örneğin: TR0380000000608010167519

source: Save IBAN
tr: IBAN'ı Kaydet

# ibanSaveFailed
source: Failed to save IBAN please try again
tr: IBAN kaydedilemedi, lütfen tekrar deneyin

# ibanSaveSuccess
source: IBAN saved successfully!
tr: IBAN başarıyla kaydedildi!

# addFriendIban
source: Add Friend's IBAN
tr: Arkadaş IBAN'ı Ekle

# friendNameHint
source: e.g. Anas al
tr: örneğin: Anas al

# pleaseEnterFriendName
source: Please enter your friend's name
tr: Lütfen arkadaşınızın adını girin

# alignQr
source: Align the QR code within the frame
tr: QR kodunu çerçevenin içine hizalayın

source: Scan QR Code
tr: QR Kodunu Tarayın

# logedOut
source: Loged out successfuly
tr: Başarıyla çıkış yaptınız!

# loginSubtitle
source: You can login with your username and password.
tr: Kullanıcı adınız ve şifrenizle giriş yapabilirsiniz.

source: Username
tr: Kullanıcı Adı

# usernameRequired
source: Username is required
tr: Kullanıcı adı zorunludur

source: Password
tr: Şifre

# passwordRequired
source: Password is required
tr: Şifre zorunludur

source: Login
tr: Giriş Yap

# pleaseWait
source: Please wait a moment
tr: Lütfen bekleyin...

# forgotPassword
source: I forgot my password
tr: Şifremi unuttum

# securityQuestionTitle
source: Security Question
tr: Güvenlik Sorusu

# securityQuestionSubtitle
source: Please select and answer the question you entered when you signed up.
tr: Kayıt olurken girdiğiniz güvenlik sorusunu seçip cevaplayın.

# chooseQuestion
source: Choose a question
tr: Soru seçin

# questionRequired
source: Please select a question
tr: Lütfen bir soru seçin

# typeAnswer
source: Type your answer
tr: Cevabınızı yazın

# answerRequired
source: Please enter your answer
tr: Lütfen cevabınızı girin

source: Send
tr: Gönder

source: Reset Account
tr: Hesabı Sıfırla

source: New Username
tr: Yeni Kullanıcı Adı

# enterUsername
source: Please enter a username
tr: Lütfen bir kullanıcı adı girin

source: New Security Question
tr: Yeni Güvenlik Sorusu

source: New Password
tr: Yeni Şifre

source: Confirm New Password
tr: Yeni Şifreyi Onayla

# passwordTooShort
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalıdır

# passwordsDontMatch
source: Passwords doesn't match
tr: Şifreler eşleşmiyor

source: Submit
tr: Gönder

# loginFailed
source: Login failed, please try again
tr: Giriş başarısız, lütfen tekrar deneyin

# resetSuccess
source: Account reset successful
tr: Hesap başarıyla sıfırlandı

# resetFailed
source: Failed to reset account
tr: Hesap sıfırlanamadı

# questionFavFood
source: What is your favorite food?
tr: En sevdiğiniz yemek nedir?

# questionMotherMaiden
source: What is your mother's maiden name?
tr: Annenizin kızlık soyadı nedir?

# questionFirstPet
source: What is the name of your first pet?
tr: İlk evcil hayvanınızın adı nedir?

# questionBirthCity
source: In what city were you born?
tr: Hangi şehirde doğdunuz?

# loginbtn
source: Login
tr: Giriş

# signUpbtn
source: Sign Up
tr: Kayıt ol

# userRegisterSuccess
source: User registered successfully.
tr: Kullanıcı başarıyla kaydedildi.

# usernameExists
source: Username already exists.
tr: Bu kullanıcı adı zaten mevcut.

# registerFailed
source: Registration failed
tr: Kayıt başarısız

# loginSuccess
source: Logged in successfully.
tr: Başarıyla giriş yaptınız.

# loginInvalid
source: Incorrect username or password.
tr: Kullanıcı adı veya şifre yanlış.

# securityQuestionWrong
source: Incorrect answer to the security question.
tr: Güvenlik sorusunun cevabı yanlış.

# unexpectedError
source: An unexpected error occurred
tr: Beklenmeyen bir hata oluştu

# editSuccess
source: Your information updated successfully. Try to login again!
tr: Bilgileriniz başarıyla güncellendi. Tekrar giriş yapmayı deneyin!

# editFailed
source: Failed to update user information.
tr: Kullanıcı bilgileri güncellenemedi.

source: Sign Up Screen
tr: Kayıt Ol Sayfası

# signUpSubtitle
source: You can SignUp with your username and password.
tr: Kullanıcı adı ve şifrenizle kayıt olabilirsiniz.

source: Confirm Password
tr: Şifreyi Onayla

# confirmPasswordRequired
source: Confirm Password is required
tr: Şifre onayı zorunludur

source: Passwords do not match
tr: Şifreler uyuşmuyor

source: Security Question
tr: Güvenlik Sorusu

# selectSecurityQuestion
source: Please select a security question
tr: Lütfen bir güvenlik sorusu seçin

source: Your Answer
tr: Cevabınız

source: Sign Up
tr: Kayıt Ol

# registrationSuccess
source: User registered successfully.
tr: Kullanıcı başarıyla kaydedildi.

# registrationFailed
source: Username already exists.
tr: Bu kullanıcı adı zaten mevcut.

# rememberAnswerNote
source: Don't forget this answer, you will need it when recovering your account.
tr: Bu cevabı unutmayın, hesabınızı kurtarırken buna ihtiyacınız olacaktır.

# confirmDeleteTitle
source: Delete IBAN
tr: IBAN Silinsin mi?

# confirmDeleteMessage
source: Are you sure you want to delete this IBAN?
tr: Bu IBAN'ı silmek istediğinizden emin misiniz?

source: Delete
tr: Sil

source: Security question matched!
tr: Güvenlik sorusu eşleşti!

# securityQuestionIncorrect
source: Incorrect answer to the security question.
tr: Güvenlik sorusunun cevabı yanlıştır. Lütfen tekrar deneyin!

# userInfoUpdated
source: Your information updated successfully. Try to login again!
tr: Bilgileriniz başarıyla güncellendi. Tekrar giriş yapmayı deneyin!

# userInfoUpdateFailed
source: Failed to update user information.
tr: Kullanıcı bilgileri güncellenemedi.

# logOutBtn
source: log Out
tr: Çıkış yap

source: Select Language
tr: Dil Seçin

# update
source: Düzenle
tr: Update

source: Another bank...
tr: Başka bir banka..
